const DOBUTSU = [
  "アイアイ",
  "アザラシ",
  "アシカ",
  "アナグマ",
  "アフリカゾウ",
  "アライグマ",
  "アリクイ",
  "アルマジロ",
  "イタチ",
  "イヌ",
  "イノシシ",
  "イルカ",
  "ウォンバット",
  "ウサギ",
  "ウシ",
  "ウマ",
  "オオカミ",
  "オットセイ",
  "オランウータン",
  "カバ",
  "カピバラ",
  "カモシカ",
  "カモノハシ",
  "カワウソ",
  "カンガルー",
  "キツネ",
  "キツネザル",
  "キリン",
  "クジラ",
  "クスクス",
  "グリズリー",
  "クロサイ",
  "コアラ",
  "コウモリ",
  "コヨーテ",
  "サイ",
  "サル",
  "シカ",
  "シマウマ",
  "ジャガー",
  "シャチ",
  "ジャッカル",
  "ジュゴン",
  "スイギュウ",
  "スカンク",
  "スナメリ",
  "セイウチ",
  "センザンコウ",
  "ゾウ",
  "タヌキ",
  "チーター",
  "チンパンジー",
  "ツキノワグマ",
  "ツチブタ",
  "ツパイ",
  "トド",
  "トナカイ",
  "トラ",
  "ナマケモノ",
  "ニルガイ",
  "ヌー",
  "ネコ",
  "ネズミ",
  "ハイエナ",
  "バク",
  "ハクビシン",
  "ハムスター",
  "ハリネズミ",
  "パンダ",
  "ビーバー",
  "ヒグマ",
  "ビッグホーン",
  "ヒツジ",
  "ピューマ",
  "ヒョウ",
  "フェネック",
  "ブタ",
  "プレーリードッグ",
  "ホッキョクグマ",
  "マーモセット",
  "マッコウクジラ",
  "マナティー",
  "マングース",
  "マントヒヒ",
  "マンドリル",
  "ミンク",
  "モモンガ",
  "モルモット",
  "ヤギ",
  "ヤク",
  "ヤマアラシ",
  "ライオン",
  "ラクダ",
  "ラッコ",
  "ラマ",
  "リス",
  "リスザル",
  "レッサーパンダ",
  "ロバ",
  "ワラビー"
];

class DobutsuCode {
  static encode(n, beam) {
    if (n < 0) {
      throw new Error("n < 0");
    }
    if (!beam) {
      beam = Math.ceil(Math.log10(n + 1) / 2);
    }
    const res = [];
    for (let i = beam - 1; i >= 0; i--) {
      const m = Math.floor(n / Math.pow(100, i)) % 100;
      res.push(DOBUTSU[m])
    }
    return res.join(" ");
  }
  static decode(s) {
    s = s.replace(/\s+/g, " ");
    s = s.replace(/\,/g, " ");
    s = s.replace(/　/g, " ");
    s = s.trim();
    const n = s.split(" ");
    let res = 0;
    let beam = 1;
    for (let i = n.length - 1; i >= 0; i--) {
      const m = DOBUTSU.indexOf(n[i]);
      if (m < 0) {
        throw new Error("illegal code");
      }
      res += m * beam;
      beam *= 100;
    }
    return res;
  }
}

export { DobutsuCode };
